<a href="https://colab.research.google.com/github/yeokyungkim/hello-world-/blob/main/homework_nataliakim.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#Homework_1_cakes_assignment
number_of_cake = 3


#testing if number of cake is greater than 4
if number_of_cake > 4:
  print("Everybody is happy.")

#testing if number of cake is equal to 4
elif number_of_cake == 4:
 print("We are not happy.")
else:
  print("We are not happy.")

We are not happy.

In [ ]:
#Homework_1_cakes_assignment
number_of_cake = 3

#testing if number of cake is greater than 4
if number_of_cake > 4:
  print("Everybody is happy.")

#testing if number of cake is equal or less than 4
elif number_of_cake < 4 or number_of_cake == 4:
    print("We are not happy.")

We are not happy.

In [ ]:
#Homework_1_cakes_assignment
number_of_cake = 4

#if you have exactly 4 or less than 4 cakes
if number_of_cake <= 4:
  print("We are not happy.")

#if above conditions is not met
else: 
  print("Everbody is happy.")

We are not happy.

In [ ]:
#Homework_1_cakes_assignment
number_of_cake = 5

if number_of_cake > 4:
  print ("Everyone is happy.")
else:
  print ("We are not happy.")

#if number of cakes is greater than number of student 
  if number_of_cake == 4:
   print("Even though we have 4 cakes, we are still not happy.")

Everyone is happy.

In [ ]:
#Homework_2_cakes_assignment

number_of_cake = 3
number_of_student = 4

#substraction to calculate extra number of cake 
extra_number_of_cake = sub = number_of_cake - number_of_student

#testing if number of cake is greater than 4
if number_of_cake > number_of_student:
  #if true, print below
  print("Everybody is happy.")
  #if false, print below
elif number_of_cake == number_of_student:
  print("We are not happy.")
else:
  print("We are not happy.")


#If there is extra cakes, how many more people can we feed in the classroom? 

if number_of_cake > number_of_student:
  print("If there is" + " " + str(number_of_cake) + " " + "cakes," + " " + "we can feed" + " " + str(sub) + " " + "more people.")

We are not happy.

In [ ]:
# Class Exercise about Loop and Titanic
num = float(input("Enter the number:"))
num = 1
while num < 123:
  print("Passenger" + " " + str(num))
  num = num + 1
print("Passenger" + " " + str(num))

In [ ]:
# Class Exercise about Loop and Titanic_revision

#use the loop method to show the list of passengers on the passenger list
total_number_of_passengers = float(input("Enter the number of passengers:"))

passenger_incrementing = 1
# number of passengers is less than the total number of passengers on the boat
while passenger_incrementing < total_number_of_passengers:
  print("Passenger" + " " + str(passenger_incrementing))
  passenger_incrementing = passenger_incrementing + 1
print("Passenger" + " " + str(passenger_incrementing))

**Homework 3.0 - while** 
-> Request the user to type a number (any positive number) -> decrease is value until 0 (12,11,10, .... 0) 
-> Verify that your program doesn't bug if the user type a negative number (you input a negative number)

In [ ]:
#Homework_3_while

#Ask user to type a random number
number = float(input("Type the number:"))

#number value will decrease by 1 until it reaches 0 and print the number
while number > 0: 
 print(int(number))
 number = number - 1
 
 #if user inputs a number less than 1, system will not generate any more number
 if number <= 0:
   print("0")
   break

Type the number:0

**Homework 4.0** - For from list of ingredients here, create a recipe asking to add all the ingredients to the plate.

ingredient_list = ["apple", "sugar", "lemon", "yogurt", "flour"] -> "add the apple, the sugar, ..." and that is flexible to the number of ingredients

In [ ]:
#Homework_4_for_ver 1

#create the ingredient list
ingredient_list = ["apple", "sugar", "lemon", "yogurt", "flour"]

#list all the ingredients on the list and stop. 

print("Add the " + ingredient_list[0] + ", " + ingredient_list[1] + ", " + ingredient_list[2] + ", " + ingredient_list[3] + ", " + ingredient_list[4] +".")
#print("Add the " + str(ingredient_list))

Add the apple, sugar, lemon, yogurt, flour.

In [ ]:
#Homework_4_for_ver 2

#create the ingredient list
ingredient_list = ["apple", "sugar", "lemon", "yogurt", "flour"]

#list all the ingredients on the list and stop. 
for ingredient in ingredient_list:
  print("Add the " + str(ingredient) + ".")

Add the apple.
Add the sugar.
Add the lemon.
Add the yogurt.
Add the flour.

In [ ]:
df[df['W']>0]

1. on kaggle -> get csv file of titanic

2. import on google colab

3. Display the imported data

4. Slice data to extract only the Womans of the passengers

**Importing dataframe (.CSV) from Kaggle to Google Colab** **& Displaying the data**

In [25]:
# Importing titanic dataset CSV from Kaggle to dataframe
import pandas as pd

# After importing CSV data, display data by locating file location
list_of_titanic_passengers = pd.read_csv('tested.csv')
display(list_of_titanic_passengers)

     PassengerId  Survived  Pclass  ...      Fare Cabin  Embarked
0            892         0       3  ...    7.8292   NaN         Q
1            893         1       3  ...    7.0000   NaN         S
2            894         0       2  ...    9.6875   NaN         Q
3            895         0       3  ...    8.6625   NaN         S
4            896         1       3  ...   12.2875   NaN         S
..           ...       ...     ...  ...       ...   ...       ...
413         1305         0       3  ...    8.0500   NaN         S
414         1306         1       1  ...  108.9000  C105         C
415         1307         0       3  ...    7.2500   NaN         S
416         1308         0       3  ...    8.0500   NaN         S
417         1309         0       3  ...   22.3583   NaN         C

[418 rows x 12 columns]

**Analyzing Titanic Data by Sex**

In [26]:
sorted_values = list_of_titanic_passengers.sort_values("Sex")
display(sorted_values)

     PassengerId  Survived  Pclass  ...      Fare Cabin  Embarked
208         1100         1       1  ...   27.7208   A11         C
138         1030         1       3  ...    8.0500   NaN         S
330         1222         1       2  ...   36.7500   NaN         S
140         1032         1       3  ...   46.9000   NaN         S
141         1033         1       1  ...  151.5500   NaN         S
..           ...       ...     ...  ...       ...   ...       ...
167         1059         0       3  ...   34.3750   NaN         S
166         1058         0       1  ...   50.4958   B10         C
164         1056         0       2  ...   13.0000   NaN         S
131         1023         0       1  ...   28.5000   C51         C
417         1309         0       3  ...   22.3583   NaN         C

[418 rows x 12 columns]

**Filtering Titanic Data by Name & Sex**

In [22]:
name_sex = list_of_titanic_passengers[["Name", "Sex"]]
print(name_sex)

TypeError: ignored

**Analyzing Titanic data by Sex using Value Count**

In [27]:
list_of_titanic_passengers["Sex"].value_counts()
#Sex_map = {'female' = 0, 'male' = 1}
#list_of_female_passengers= list_of_titanic_passengers[list_of_titanic_passengers["Sex"]==0]
display(list_of_female_passengers)

NameError: ignored

**Saving the data treated from Titanic**

In [ ]:
list_of_titanic_passengers.to_csv('file_name.csv')

## ***March 15 Class Coding Examples***

In [13]:
# Render plots inline
%matplotlib inline

# Import libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
# Set style for all graphs
sns.set_style("dark")

**Present first & last 5 data excercises**

In [14]:
# Present first 5 data from imported Titanic data 
list_of_titanic_passengers.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0          892         0       3  ...   7.8292   NaN         Q
1          893         1       3  ...   7.0000   NaN         S
2          894         0       2  ...   9.6875   NaN         Q
3          895         0       3  ...   8.6625   NaN         S
4          896         1       3  ...  12.2875   NaN         S

[5 rows x 12 columns]

In [28]:
# Present last 5 data from imported Titanic data
list_of_titanic_passengers.tail()

     PassengerId  Survived  Pclass  ...      Fare Cabin  Embarked
413         1305         0       3  ...    8.0500   NaN         S
414         1306         1       1  ...  108.9000  C105         C
415         1307         0       3  ...    7.2500   NaN         S
416         1308         0       3  ...    8.0500   NaN         S
417         1309         0       3  ...   22.3583   NaN         C

[5 rows x 12 columns]

***Clean up duplicated data ***

In [16]:
# Identify and remove duplicated data
list_of_titanic_passengers = list_of_titanic_passengers.drop_duplicates
print(list_of_titanic_passengers)

<bound method DataFrame.drop_duplicates of      PassengerId  Survived  Pclass  ...      Fare Cabin  Embarked
0            892         0       3  ...    7.8292   NaN         Q
1            893         1       3  ...    7.0000   NaN         S
2            894         0       2  ...    9.6875   NaN         Q
3            895         0       3  ...    8.6625   NaN         S
4            896         1       3  ...   12.2875   NaN         S
..           ...       ...     ...  ...       ...   ...       ...
413         1305         0       3  ...    8.0500   NaN         S
414         1306         1       1  ...  108.9000  C105         C
415         1307         0       3  ...    7.2500   NaN         S
416         1308         0       3  ...    8.0500   NaN         S
417         1309         0       3  ...   22.3583   NaN         C

[418 rows x 12 columns]>

In [20]:
# Identify and remove duplicated data
list_of_titanic_passengers = list_of_titanic_passengers.drop_duplicates
display(list_of_titanic_passengers)

<bound method DataFrame.drop_duplicates of      PassengerId  Survived  Pclass  ...      Fare Cabin  Embarked
0            892         0       3  ...    7.8292   NaN         Q
1            893         1       3  ...    7.0000   NaN         S
2            894         0       2  ...    9.6875   NaN         Q
3            895         0       3  ...    8.6625   NaN         S
4            896         1       3  ...   12.2875   NaN         S
..           ...       ...     ...  ...       ...   ...       ...
413         1305         0       3  ...    8.0500   NaN         S
414         1306         1       1  ...  108.9000  C105         C
415         1307         0       3  ...    7.2500   NaN         S
416         1308         0       3  ...    8.0500   NaN         S
417         1309         0       3  ...   22.3583   NaN         C

[418 rows x 12 columns]>

**Remove unused columns**

In [29]:
list_of_titanic_passengers_cleaned = list_of_titanic_passengers.drop(['PassengerId','Ticket','Cabin','Fare','Embarked'], axis=1)
list_of_titanic_passengers_cleaned.head()

   Survived  Pclass  ... SibSp Parch
0         0       3  ...     0     0
1         1       3  ...     1     0
2         0       2  ...     0     0
3         0       3  ...     0     0
4         1       3  ...     1     1

[5 rows x 7 columns]

**Fix any missing or data format issue**

In [ ]:
#Calculate number of missing values 
list_of_titanic_passengers_cleaned.isnull().sum()
#Review some of missing age data 
missing_age_bool = pd.isnull(list_of_titanic_passengers_cleaned['Age'])
list_of_titanic_passengers_cleaned[missing_age_bool].head()

    Survived  Pclass  ... SibSp Parch
10         0       3  ...     0     0
22         1       1  ...     0     0
29         0       3  ...     2     0
33         1       3  ...     1     2
36         1       3  ...     0     0

[5 rows x 7 columns]

In [30]:
#Calculate number of missing values 
list_of_titanic_passengers_cleaned.isnull().sum()
#Review some of missing age data 
missing_age_bool = pd.isnull(list_of_titanic_passengers_cleaned['Age'])
list_of_titanic_passengers_cleaned[missing_age_bool].tail()

     Survived  Pclass                             Name  ... Age  SibSp  Parch
408         1       3  Riordan, Miss. Johanna Hannah""  ... NaN      0      0
410         1       3           Naughton, Miss. Hannah  ... NaN      0      0
413         0       3               Spector, Mr. Woolf  ... NaN      0      0
416         0       3              Ware, Mr. Frederick  ... NaN      0      0
417         0       3         Peter, Master. Michael J  ... NaN      1      1

[5 rows x 7 columns]

In [ ]:
#Determine number of males and females with missing age values
missing_age_female = list_of_titanic_passengers_cleaned[missing_age_bool]['Sex'] == 'female'
missing_age_male = list_of_titanic_passengers_cleaned[missing_age_bool]['Sex'] == 'male'
print(missing_age_female.sum())
print(missing_age_male.sum())

25
61

**Data Exploration and Visualization**

In [ ]:
#Looking at some tyoical descriptive statistics 
list_of_titanic_passengers_cleaned.describe()

         Survived      Pclass         Age       SibSp       Parch
count  418.000000  418.000000  332.000000  418.000000  418.000000
mean     0.363636    2.265550   30.272590    0.447368    0.392344
std      0.481622    0.841838   14.181209    0.896760    0.981429
min      0.000000    1.000000    0.170000    0.000000    0.000000
25%      0.000000    1.000000   21.000000    0.000000    0.000000
50%      0.000000    3.000000   27.000000    0.000000    0.000000
75%      1.000000    3.000000   39.000000    1.000000    0.000000
max      1.000000    3.000000   76.000000    8.000000    9.000000

In [ ]:
#filter the date to check on people on board less than 1 year old
people_less_than_1yr_old = list_of_titanic_passengers_cleaned[list_of_titanic_passengers_cleaned['Age'] < 1]
display(people_less_than_1yr_old)

     Survived  Pclass  ... SibSp Parch
201         0       3  ...     0     2
250         1       2  ...     1     2
281         0       3  ...     1     1
307         0       3  ...     0     1
354         1       3  ...     1     2

[5 rows x 7 columns]

In [33]:
#Slice
#exemple : df[df['W']>0][['X','Y']] 

#1- Using slicing : Extract all the male in a dataframe and display it
male_dataframe = list_of_titanic_passengers_cleaned[list_of_titanic_passengers_cleaned['Sex'] == "male"]
display(male_dataframe)

female_dataframe = list_of_titanic_passengers_cleaned[list_of_titanic_passengers_cleaned['Sex'] == "female"]
display(female_dataframe)

#2- Using slicing : Extract all the people who survived in a dataframe and display it
survived_passengers = list_of_titanic_passengers_cleaned[list_of_titanic_passengers_cleaned['Survived'] == 1]
display(survived_passengers)

dead_passengers = list_of_titanic_passengers_cleaned[list_of_titanic_passengers_cleaned['Survived'] == 0]
display(dead_passengers)
# to extract min / max of a dataframe, add .min() or .max at the end of dataframe :

#- using this, create a variable to answer :
#3- youngest_to_survive = 
#youngest_survived_passengers = list_of_titanic_passengers_cleaned[list_of_titanic_passengers_cleaned['Survived'] == 1].min()
#display(youngest_survived_passengers)

youngest_survived_passengers = survived_passengers.min()
print(youngest_survived_passengers)

#4- youngest_to_die = 
#youngest_dead_passengers = list_of_titanic_passengers_cleaned[list_of_titanic_passengers_cleaned['Survived'] == 0].min()
#display(youngest_dead_passengers)

youngest_dead_passengers = dead_passengers.min()
print(youngest_dead_passengers)

#5- oldest_to_die =
oldest_dead_passengers = list_of_titanic_passengers_cleaned[list_of_titanic_passengers_cleaned['Survived'] == 0].max()
display(oldest_dead_passengers)

#6- oldest_to_survived = 
oldest_survived_passengers = survived_passengers.max()
print(oldest_survived_passengers)

#7- slice the passengers in 3 data frames: using .mean()
Firstclass = list_of_titanic_passengers_cleaned[list_of_titanic_passengers_cleaned['Pclass'] == 1]
print(Firstclass)

Secondclass = list_of_titanic_passengers_cleaned[list_of_titanic_passengers_cleaned['Pclass']== 2]
print(Secondclass)

Thirdclass = list_of_titanic_passengers_cleaned[list_of_titanic_passengers_cleaned['Pclass']== 3]
print(Thirdclass)

AverageageFirstclass = Firstclass['Age'].mean()
print(AverageageFirstclass)

AverageageSecondclass = Secondclass['Age'].mean()
print(AverageageSecondclass)

AverageageThirdclass = Thirdclass['Age'].mean()
print(AverageageThirdclass)

     Survived  Pclass                          Name   Sex   Age  SibSp  Parch
0           0       3              Kelly, Mr. James  male  34.5      0      0
2           0       2     Myles, Mr. Thomas Francis  male  62.0      0      0
3           0       3              Wirz, Mr. Albert  male  27.0      0      0
5           0       3    Svensson, Mr. Johan Cervin  male  14.0      0      0
7           0       2  Caldwell, Mr. Albert Francis  male  26.0      1      1
..        ...     ...                           ...   ...   ...    ...    ...
407         0       1    Widener, Mr. George Dunton  male  50.0      1      1
413         0       3            Spector, Mr. Woolf  male   NaN      0      0
415         0       3  Saether, Mr. Simon Sivertsen  male  38.5      0      0
416         0       3           Ware, Mr. Frederick  male   NaN      0      0
417         0       3      Peter, Master. Michael J  male   NaN      1      1

[266 rows x 7 columns]

     Survived  Pclass  ... SibSp Parch
1           1       3  ...     1     0
4           1       3  ...     1     1
6           1       3  ...     0     0
8           1       3  ...     0     0
12          1       1  ...     1     0
..        ...     ...  ...   ...   ...
409         1       3  ...     1     1
410         1       3  ...     0     0
411         1       1  ...     1     0
412         1       3  ...     0     0
414         1       1  ...     0     0

[152 rows x 7 columns]

     Survived  Pclass  ... SibSp Parch
1           1       3  ...     1     0
4           1       3  ...     1     1
6           1       3  ...     0     0
8           1       3  ...     0     0
12          1       1  ...     1     0
..        ...     ...  ...   ...   ...
409         1       3  ...     1     1
410         1       3  ...     0     0
411         1       1  ...     1     0
412         1       3  ...     0     0
414         1       1  ...     0     0

[152 rows x 7 columns]

     Survived  Pclass                          Name   Sex   Age  SibSp  Parch
0           0       3              Kelly, Mr. James  male  34.5      0      0
2           0       2     Myles, Mr. Thomas Francis  male  62.0      0      0
3           0       3              Wirz, Mr. Albert  male  27.0      0      0
5           0       3    Svensson, Mr. Johan Cervin  male  14.0      0      0
7           0       2  Caldwell, Mr. Albert Francis  male  26.0      1      1
..        ...     ...                           ...   ...   ...    ...    ...
407         0       1    Widener, Mr. George Dunton  male  50.0      1      1
413         0       3            Spector, Mr. Woolf  male   NaN      0      0
415         0       3  Saether, Mr. Simon Sivertsen  male  38.5      0      0
416         0       3           Ware, Mr. Frederick  male   NaN      0      0
417         0       3      Peter, Master. Michael J  male   NaN      1      1

[266 rows x 7 columns]

Survived                              1
Pclass                                1
Name        Abelseth, Miss. Karen Marie
Sex                              female
Age                                0.17
SibSp                                 0
Parch                                 0
dtype: object
Survived                                0
Pclass                                  1
Name        Abbott, Master. Eugene Joseph
Sex                                  male
Age                                  0.33
SibSp                                   0
Parch                                   0
dtype: object

Survived                                    0
Pclass                                      3
Name        van Billiard, Master. Walter John
Sex                                      male
Age                                        67
SibSp                                       8
Parch                                       9
dtype: object

Survived                                                1
Pclass                                                  3
Name        del Carlo, Mrs. Sebastiano (Argenia Genovesi)
Sex                                                female
Age                                                    76
SibSp                                                   8
Parch                                                   9
dtype: object
     Survived  Pclass  ... SibSp Parch
11          0       1  ...     0     0
12          1       1  ...     1     0
14          1       1  ...     1     0
20          0       1  ...     1     0
22          1       1  ...     0     0
..        ...     ...  ...   ...   ...
403         0       1  ...     0     0
404         0       1  ...     1     0
407         0       1  ...     1     1
411         1       1  ...     1     0
414         1       1  ...     0     0

[107 rows x 7 columns]
     Survived  Pclass  ... SibSp Parch
2           0       2  ...     0     0
7           0       2  ...     1     1
13          0       2  ...     1     0
15          1       2  ...     1     0
16          0       2  ...     0     0
..        ...     ...  ...   ...   ...
387         0       2  ...     0     0
393         0       2  ...     0     0
401         0       2  ...     1     0
405         0       2  ...     0     0
406         0       2  ...     1     0

[93 rows x 7 columns]
     Survived  Pclass  ... SibSp Parch
0           0       3  ...     0     0
1           1       3  ...     1     0
3           0       3  ...     0     0
4           1       3  ...     1     1
5           0       3  ...     0     0
..        ...     ...  ...   ...   ...
412         1       3  ...     0     0
413         0       3  ...     0     0
415         0       3  ...     0     0
416         0       3  ...     0     0
417         0       3  ...     1     1

[218 rows x 7 columns]
40.91836734693877
28.7775
24.02794520547945

### **Restaurant Class Excercise (Top250.csv)**

https://www.kaggle.com/michau96/restaurant-business-rankings-2020

In [42]:
import pandas as pd
restaurant_list = pd.read_csv("Top250.csv")
display(restaurant_list)

#Slicing : Filter restaurnats by filter and find average ranks
ChickenRestaurantList=restaurant_list[restaurant_list['Segment_Category']=="Quick Service & Chicken"]
display(ChickenRestaurantList)

AvgRankOfChickenRestaurant=ChickenRestaurantList['Rank'].mean()
print(AvgRankOfChickenRestaurant)

BurgerRestaurantList=restaurant_list[restaurant_list['Segment_Category']=="Quick Service & Burger"]
display(BurgerRestaurantList)

CoffeeRestaurantList=restaurant_list[restaurant_list['Segment_Category']=="Quick Service & Coffee Cafe"]
display(CoffeeRestaurantList)

AvgRankOfCoffeeRestaurnt=CoffeeRestaurantList['Rank'].mean()
print(AvgRankOfCoffeeRestaurnt)

     Rank           Restaurant  ... Headquarters             Segment_Category
0       1           McDonald's  ...          NaN       Quick Service & Burger
1       2            Starbucks  ...          NaN  Quick Service & Coffee Cafe
2       3          Chick-fil-A  ...          NaN      Quick Service & Chicken
3       4            Taco Bell  ...          NaN      Quick Service & Mexican
4       5          Burger King  ...          NaN       Quick Service & Burger
..    ...                  ...  ...          ...                          ...
245   246      Rainforest Cafe  ...          NaN                  Varied Menu
246   247                  PDQ  ...          NaN                      Chicken
247   248        Lupe Tortilla  ...          NaN                      Mexican
248   249  Cook-Out Restaurant  ...          NaN                       Burger
249   250             Jollibee  ...          NaN                      Chicken

[250 rows x 9 columns]

    Rank                 Restaurant  ... Headquarters         Segment_Category
2      3                Chick-fil-A  ...          NaN  Quick Service & Chicken
13    14                        KFC  ...          NaN  Quick Service & Chicken
18    19  Popeyes Louisiana Kitchen  ...          NaN  Quick Service & Chicken
46    47                 Bojangles'  ...          NaN  Quick Service & Chicken
53    54              El Pollo Loco  ...          NaN  Quick Service & Chicken
64    65           Church's Chicken  ...          NaN  Quick Service & Chicken

[6 rows x 9 columns]

33.666666666666664

    Rank                     Restaurant  ... Headquarters        Segment_Category
0      1                     McDonald's  ...          NaN  Quick Service & Burger
4      5                    Burger King  ...          NaN  Quick Service & Burger
6      7                        Wendy's  ...          NaN  Quick Service & Burger
12    13                 Sonic Drive-In  ...          NaN  Quick Service & Burger
23    24                Jack in the Box  ...          NaN  Quick Service & Burger
29    30                    Whataburger  ...          NaN  Quick Service & Burger
34    35                       Hardee's  ...          NaN  Quick Service & Burger
37    38                       Culver's  ...          NaN  Quick Service & Burger
42    43                     Carl's Jr.  ...          NaN  Quick Service & Burger
49    50                In-N-Out Burger  ...          NaN  Quick Service & Burger
50    51                 Steak 'n Shake  ...          NaN  Quick Service & Burger
75    76                   White Castle  ...          NaN  Quick Service & Burger
84    85  Checkers Drive-In Restaurants  ...          NaN  Quick Service & Burger

[13 rows x 9 columns]

    Rank          Restaurant  ... Headquarters             Segment_Category
1      2           Starbucks  ...          NaN  Quick Service & Coffee Cafe
7      8             Dunkin'  ...          NaN  Quick Service & Coffee Cafe
65    66         Tim Hortons  ...  Toronto, ON  Quick Service & Coffee Cafe
78    79  Dutch Bros. Coffee  ...          NaN  Quick Service & Coffee Cafe

[4 rows x 9 columns]

38.75